# Módulo 2. Tratamiento y manipulación de datos

In [ ]:
# Indexación basada en etiquetas: .loc

df.loc['customer_123', 'purchase_amount']

# Esto obtiene el importe de la compra del cliente con ID 'customer_123'. (en la fila donde está el customer_123 y en la columna de purchase_amount)

In [ ]:
# Indexación basada en posición: .iloc

df.iloc[5, 2]

# Esto obtiene el valor de la tercera columna de la sexta fila.

In [ ]:
# Indexación booleana (basada en máscaras)

# Ejemplo: seleccionar clientes con membresía Platino y más de 10 compras:

df[(df['membership_level'] == 'Platinum') & (df['number_of_purchases'] > 10)]

# Esto devuelve un DataFrame con solo los clientes que cumplen ambas condiciones.

In [ ]:
# Acceso rápido a valores individuales: .at y .iat

#.at: basado en etiquetas.


# Ejemplo:

df.at['customer_123', 'membership_level'] = 'Gold'

In [ ]:
# Método query() (similar a SQL)

# Ejemplo:

df.query("membership_level == 'Platinum' & number_of_purchases > 10")

In [ ]:
# Casos de uso prácticos:

# Análisis de ventas
# Calcular ventas totales de un producto en una región específica:

total_sales = df.loc[(df['Product'] == 'Product A') & (df['Region'] == 'North')]['Sales'].sum()


# Extracción de información de clientes
# Obtener datos de contacto de un cliente:

customer_info = df.loc[df['Name'] == 'John Doe', ['Email', 'Phone']]

In [4]:
# Importar Pandas

import pandas as pd


# Cargar un archivo CSV

df = pd.read_csv('planets_with_moons_all.csv')

# df es la variable que contiene el DataFrame.
# read_csv convierte los datos del archivo en un formato estructurado listo para analizar.


# Exploración inicial


# Visualizar las primeras filas:

df.head()

    Planet  Diameter (km)  Number of Moons
0  Mercury           4879                0
1    Venus          12104                0
2    Earth          12756                1
3     Mars           6792                2
4  Jupiter         142984               79

In [5]:
# Información general del DataFrame:

df.info()
# Muestra nombres de columnas, tipos de datos y valores faltantes.


# Estadísticas descriptivas de columnas numéricas:

df.describe()
# Proporciona recuento, media, desviación estándar y cuartiles.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Planet           8 non-null      object
 1   Diameter (km)    8 non-null      int64
 2   Number of Moons  8 non-null      int64
dtypes: int64(2), object(1)
memory usage: 324.0+ bytes

       Diameter (km)  Number of Moons
count       8.000000         8.000000
mean    50087.125000        25.750000
std     53916.366175        35.366449
min      4879.000000         0.000000
25%     10776.000000         0.750000
50%     31142.000000         8.000000
75%     68472.500000        40.000000
max    142984.000000        83.000000

In [6]:
#Formas comunes de crear DataFrames:
# Desde diccionarios

import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'], 'Age': [25, 30, 28]}
df = pd.DataFrame(data)

In [7]:
# Desde listas de listas

data = [['Alice', 25], ['Bob', 30], ['Charlie', 28]]
df = pd.DataFrame(data, columns=['Name', 'Age'])

In [ ]:
# Desde archivos CSV

df = pd.read_csv('data.csv')

# Pandas también puede importar datos de Excel (read_excel), JSON (read_json) o SQL (read_sql).

## Inspección de DataFrames
#### Pandas ofrece funciones para explorar y entender tus datos:
- df.head() → primeras 5 filas (por defecto)


- df.tail() → últimas 5 filas (por defecto)


- df.shape → dimensiones del DataFrame (filas, columnas)


- df.info() → resumen conciso: nombres de columnas, tipos de datos, valores faltantes


- df.describe() → estadísticas descriptivas de columnas numéricas: recuento, media, desviación estándar, mínimos, máximos y cuartiles

In [ ]:
# Selección de datos
# Columnas:


# Una columna → devuelve una Serie:

df['Age']

0    25
1    30
2    28
Name: Age, dtype: int64

In [10]:
# Varias columnas → devuelve un DataFrame:

df[['Name', 'Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [11]:
# Filas:

# Por etiquetas (.loc):

df.loc[0]  # fila con etiqueta 0

Name    Alice
Age        25
Name: 0, dtype: object

In [12]:
# Por posición (.iloc):

df.iloc[0]  # primera fila

Name    Alice
Age        25
Name: 0, dtype: object

In [13]:
# Filtrado de datos
# Indexación booleana: filtra filas según condiciones:

df[df['Age'] > 25]

      Name  Age
1      Bob   30
2  Charlie   28

In [14]:
# Múltiples condiciones con .query() (sintaxis tipo SQL):

df.query('Age > 25 and Name == "Bob"')

  Name  Age
1  Bob   30

In [16]:
# Gestión de datos faltantes
# Detectar valores faltantes (NaN):

df.isnull()          # todo el DataFrame

    Name    Age
0  False  False
1  False  False
2  False  False

In [17]:
df['Age'].isnull()   # columna específica

0    False
1    False
2    False
Name: Age, dtype: bool

In [18]:
# Eliminar filas con valores faltantes:

df.dropna()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [19]:
# Rellenar valores faltantes:

df.fillna(0)  # con un valor fijo

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   28

In [20]:
df['Age'].fillna(df['Age'].mean(), inplace=True)  # con la media de la columna

C:\Users\franc\AppData\Local\Temp\ipykernel_3644\688574357.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)  # con la media de la columna

## Mejor probar esto

#### For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.

# Actividad: Carga e inspección de datos con pandas

## Scenario: Charting the Customer Journey with Pandas

Imagine you're a Python developer at a rapidly growing e-commerce company. The marketing team is eager to understand customer behavior and preferences to tailor their campaigns and improve the overall shopping experience. They've provided you with a valuable dataset containing information about customers, their purchases, and demographics. 

Your task is to leverage your Python skills and the power of the Pandas library to load this dataset, explore its structure, and uncover preliminary insights that will guide further analysis. This initial exploration is crucial for understanding the data you're working with and making informed decisions about how to proceed with more in-depth analysis and visualization.

In the cell below, begin by importing the `pandas` library with the alias `pd`. Then, use `.read_csv()` to load the `customer_data_50.csv` file into a DataFrame named `customer_data`. 

Lastly, run the cell.

In [2]:
# Import the pandas library with the alias 'pd'

# insert code here 
import pandas as pd

# Load the CSV file 'customer_data_50.csv' into a DataFrame

# insert code here 
customer_data = pd.read_csv('customer_data_50.csv')

Run the following cell, which will check the dimensions of your DataFrame using the `.shape` attribute. This tells you how many rows and columns your data has – kind of like figuring out the size of a spreadsheet!

In [3]:
# Display the shape of the DataFrame (rows, columns)
print("\nShape of the DataFrame (rows, columns):", customer_data.shape)

Shape of the DataFrame (rows, columns): (50, 13)

Next, you'll inspect the data using the `df.head()` function, which allows you to view the first few rows of the DataFrame. This gives you a quick look at the data's structure and content.

In the cell below, use `df.head()`to display the first 5 rows of the `customer_data` DataFrame.  Then, run the cell and take a moment to observe the output.

In [ ]:
# Display the first 5 rows
print("First 5 rows:\n")

# insert code here
print(customer_data.head())

First 5 rows:

   customer_id first_name  last_name                       email gender  age  \
0         1001     Sophia      Smith    sophia.smith@example.com      M   54
1         1002     Joseph      Smith    joseph.smith@example.com      M   66
2         1003       John   Anderson   john.anderson@example.com      F   56
3         1004       Emma  Hernandez  emma.hernandez@example.com      M   44
4         1005      Emily     Garcia    emily.garcia@example.com      F   25

          city state country  purchase_count  total_spend  avg_order_value  \
0  San Antonio    TX     USA               5          965            193.0
1  Los Angeles    CA     USA               7         1246            178.0
2      Phoenix    AZ     USA               1          199            199.0
3  Los Angeles    CA     USA              14         3752            268.0
4       Dallas    TX     USA              12         1620            135.0

           last_purchase_date
0  2023-09-12 15:28:32.140488
1  2023-08-25 15:28:32.140488
2  2024-04-28 15:28:32.140488
3  2024-01-01 15:28:32.140488
4  2023-12-09 15:28:32.140488

Now, you'll use the `df.info()` function, which provides a concise summary of the DataFrame, including the column names, their data types, and the number of non-null values.

In the cell below, use `df.info()` to print information about the `customer_data` DataFrame  Then, run the cell and take a moment to observe the output.

In [ ]:
# Print the column names and their data types
print("\nColumn names and their data types:\n")

# insert code here 
print(customer_data.info())

Column names and their data types:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         50 non-null     int64
 1   first_name          50 non-null     object
 2   last_name           50 non-null     object
 3   email               50 non-null     object
 4   gender              50 non-null     object
 5   age                 50 non-null     int64
 6   city                50 non-null     object
 7   state               50 non-null     object
 8   country             50 non-null     object
 9   purchase_count      50 non-null     int64
 10  total_spend         50 non-null     int64
 11  avg_order_value     50 non-null     float64
 12  last_purchase_date  50 non-null     object
dtypes: float64(1), int64(4), object(8)
memory usage: 5.2+ KB
None

Next, you'll use the `df.describe()` function, which generates descriptive statistics for the numerical columns in the DataFrame.

In the cell below, use `df.describe()` to display summary statistics for the numerical columns in the `customer_data` DataFrame.

In [ ]:
# Display descriptive statistics for numerical columns
print("\nDescriptive statistics for numerical columns:\n")

# insert code here 
print(customer_data.describe())

Descriptive statistics for numerical columns:

       customer_id        age  purchase_count  total_spend  avg_order_value
count     50.00000  50.000000        50.00000    50.000000        50.000000
mean    1025.50000  43.440000         8.60000  1491.880000       179.920000
std       14.57738  14.833993         4.28095   968.697666        70.820221
min     1001.00000  19.000000         1.00000   199.000000        53.000000
25%     1013.25000  30.000000         5.00000   819.000000       125.750000
50%     1025.50000  44.500000         8.00000  1350.000000       180.000000
75%     1037.75000  54.000000        12.00000  1916.000000       237.500000
max     1050.00000  69.000000        15.00000  4440.000000       299.000000

Finally, in the code cell below, you'll use the `.mean()` and `.median()` functions on the `'age'` column of your `customer_data` to calculate the average and median age of all your customers. 

The square brackets [] are used for column selection in Pandas. Within the brackets, you specify the name of the column you want to extract, which in this case is 'age'

Run the cell to see the average and median age of your customers.

In [9]:
# Calculate the mean of the 'age' column
mean_age = customer_data['age'].mean() # insert code here 

# Print the mean age
print("\nMean Age:", mean_age)

# Calculate the median of the 'age' column
median_age = customer_data['age'].median() # insert code here 

# Print the median age
print("\nMedian Age:", median_age)

Mean Age: 43.44

Median Age: 44.5

## Activity Recap: Charting the Customer Journey with Pandas

Congratulations! In this activity, you learned how to load a CSV file into a Pandas DataFrame and use various functions to inspect its structure and contents:

* `pd.read_csv()` is used to load CSV data into a DataFrame.
* `df.head()` shows the first few rows.
* `df.info()` provides a summary of the DataFrame's structure.
* `df.describe()` generates descriptive statistics for numerical columns.

### Cómo gestionar los duplicados en Python con pandas
##### Importar pandas y cargar los datos

- import pandas as pd
- datos = pd.read_csv("tus_datos.csv")


##### Detectar duplicados

- duplicados = datos.duplicated()
##### Esto devuelve un valor booleano para cada fila indicando si está duplicada.


##### Visualizar las filas duplicadas

- filas_duplicadas = datos[datos.duplicated()]
- print(filas_duplicadas)


##### Eliminar duplicados

- datos = datos.drop_duplicates()

##### Dentro del argumento

-- keep='first' → conserva la primera aparición (predeterminado).


-- keep='last' → conserva la última.


-- keep=False → elimina todas las filas duplicadas.

# Cómo abordar la falta de datos con Pandas

In [11]:
import pandas as pd
import numpy as np

# Crear un DataFrame con valores perdidos
data = {'Name': ['Alice', 'Bob', np.nan, 'David'], 
        'Age': [25, 30, np.nan, 35], 
        'City': ['New York', np.nan, 'London', 'Paris']}
df = pd.DataFrame(data)

# 1. Identificar valores perdidos
print("Missing value counts per column:\n", df.isnull().sum())

# 2. Eliminar filas con valores perdidos
df_dropped = df.dropna()
print("\nDataFrame after dropping rows with any missing value:\n", df_dropped)

# 3. Imputar valores faltantes con la media
df_filled_mean = df.fillna(df.mean(numeric_only=True))
print("\nDataFrame after filling missing 'Age' with mean:\n", df_filled_mean)

# 3. Imputar valores faltantes con la mediana
df_filled_median = df.fillna(df.median(numeric_only=True))
print("\nDataFrame after filling missing 'Age' with median:\n", df_filled_median)

Missing value counts per column:
 Name    1
Age     1
City    1
dtype: int64

DataFrame after dropping rows with any missing value:
     Name   Age      City
0  Alice  25.0  New York
3  David  35.0     Paris

DataFrame after filling missing 'Age' with mean:
     Name   Age      City
0  Alice  25.0  New York
1    Bob  30.0       NaN
2    NaN  30.0    London
3  David  35.0     Paris

DataFrame after filling missing 'Age' with median:
     Name   Age      City
0  Alice  25.0  New York
1    Bob  30.0       NaN
2    NaN  30.0    London
3  David  35.0     Paris

In [13]:
# 4. Manejo de valores atípicos: limitar (capar) a 40
df['Age_capped'] = df['Age'].clip(upper=40)
print("\nDataFrame with 'Age' capped at 40:\n", df)

# 5. Conversión de tipos de datos
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')
print("\nData types after conversion:\n", df.dtypes)

# 6. Análisis exploratorio de datos (EDA)
print("\nDescriptive statistics:\n", df.describe())

DataFrame with 'Age' capped at 40:
     Name   Age      City  Age_capped
0  Alice  25.0  New York        25.0
1    Bob  30.0       NaN        30.0
2    NaN   NaN    London         NaN
3  David  35.0     Paris        35.0

Data types after conversion:
 Name           object
Age           float64
City           object
Age_capped    float64
dtype: object

Descriptive statistics:
         Age  Age_capped
count   3.0         3.0
mean   30.0        30.0
std     5.0         5.0
min    25.0        25.0
25%    27.5        27.5
50%    30.0        30.0
75%    32.5        32.5
max    35.0        35.0

In [14]:
# Agrupar por ciudad y calcular la edad promedio
grouped_data = df.groupby('City')['Age'].mean()
print("\nAverage Age by City:\n", grouped_data)

Average Age by City:
 City
London       NaN
New York    25.0
Paris       35.0
Name: Age, dtype: float64